var escape_datas = [
    {
        "date": "20141010",
        "name": "禁錮之村",
        "date_studio": "2014/10/10 GATE時空傳送局",
        "description": "此次任務為GATE時空傳送局，在台灣首次成立的任務，時空行者需要組成5～10人的團隊，透過時空傳送門，來到充滿魔法的奇幻世界，在這個半身人居住的村莊 ，找尋勇者遺留的傳說武器，解開存在於村莊的詭異謎題，尋找出封印魔龍的終極法術，阻止禁錮之村所屬世界的毀滅。禁錮之村的未來將由你來拯救！"
    },
    {
        "date": "20150208",
        "name": "「謎走時空」- 23世紀 瘋狂實驗室",
        "date_studio": "2015/02/08 RMT實境遊戲",
        "description": "打開門，一片漆黑，你知道必須盡快恢復實驗室的運作，否則時空將再次錯亂，然而未來科技的驚人發展，早就超乎你的想像……歡迎來到瘋狂實驗室！"
    },
    {
        "date": "20150301",
        "name": "尚未尋獲",
        "date_studio": "2015/03/01 Turn Right Studio",
        "description": "這組分析敏銳，能用很短的時間解出謎底的答案，雖然有個常常遺漏在面前的線索的小缺點，但整體來講還是相當的優秀，最後以總時間97分41秒成功進入轉個彎前段班！-- 8名玩家組成偵查小組，兵分兩路循線索深入綁匪的巢穴，找出兇手、背後的動機，揭開神祕綁架案的幕後真相。"
    },
    {
        "date": "20150712",
        "name": "奪命鎖鏈",
        "date_studio": "2015/07/12 笨蛋工作室",
        "description": "星期日的早晨，八位從新竹來台北玩耍的朋友們決定來挑戰奪命鎖鏈啦~~~原來我們笨蛋工作室的吸引力拿~麼大啊!!哈哈哈哈哈大家大老遠跑來一定都是箇中高手啦!!我猜低果然沒錯，大家謎題幾乎都咻咻解開呢，提示也都不太用><，大家雖然步調十分快，但是也沒有因而粗心錯過任何一個線索呢!!實在是太厲害啦!!最後為了讓時間不那麼緊迫，在謹慎地思考之下決定使用了一個提示，在最後五分鐘成功脫逃啦 ，恭喜恭喜"
    },
    {
        "date": "20160429",
        "name": "引爆思源樓",
        "date_studio": "2016/04/29 RMT實境遊戲",
        "description": "臺大創創中心是台大創業生態系的重要基地，2016 年首度整合「創創學程」、「台大車庫」及「創新設計學院」，將於4/29進行最盛大的創創週開幕活動！邀請了校內外眾多創意人才共襄盛舉，卻在此時...收到了一封秘密警告信！來自遠在英國的名偵探福爾摩斯，最近在研究一個跨國犯罪組織，據他所言，由於台大創業生態最近積極整合發展，聚集了人才的創意能量，已大大威脅到此組織。因此，他們打算在盛大的開幕式上於思源樓隱藏一個炸彈，將台大的創意精英們一網打盡！福爾摩斯已經掌握了大部分的線索，也分派他在台大的線人們協助此案的調查，無奈無法緊急趕來臺灣，他留下目前的線索給予各位菁英，時間所剩不多，再過70分鐘，炸彈即將引爆！你能找到炸彈的藏匿地點，並破解拆除的關鍵暗號全身而退嗎？！"
    },
    {
        "date": "20160828",
        "name": "諜戰1941",
        "date_studio": "2016/08/28 笨蛋工作室",
        "description": "二十世紀中葉，全球爆發了毀滅性的戰役，敵軍如日中天，盟軍則每下愈況，能夠贏下戰爭的關鍵並非武力，而是『情報』。『我們每天都會攔截到數千則敵人的加密電報，如果無法破譯，那這些情報終究只是戰場上的噪音；反之，若能了解編碼的規則便能扭轉戰局。』為了能破譯敵人密電，盟軍情報部擬定了一項艱鉅的特殊行動計畫，行動代號：Crow派遣數批詐降士兵進入戰俘營，完成這次行動的唯一目標：《竊取敵軍情報編碼規則，並逃出戰俘營》盟軍能否逆轉戰局，取決於這項秘密行動成功與否，數百萬人的命運就掌握在這些勇敢的士兵手裡！"
    },
    {
        "date": "20170430",
        "name": "捷運採地雷",
        "date_studio": "2017/04/30 城市尋寶",
        "description": "台北捷運路網變成了踩地雷遊戲！？有六個捷運站藏了地雷，你必須要實際去到各個捷運站，解開謎題，才能踩開該站得知是否有地雷。蒐齊六顆地雷，就會帶領你到最後埋藏寶藏的地點。你能多快蒐齊地雷？不僅考驗你的解謎能力，捷運路線安排、踩雷策略...等都可能影響你的成績，快來挑戰吧！"
    },
    {
        "date": "20170710",
        "name": "天方夜譚",
        "date_studio": "2017/07/10 Funlock活動創意社",
        "description": "強盛的沙漠王朝擁有世上最珍稀的寶物，卻在一夕之間消失殆盡。而你將拼湊線索，穿越破碎的矮房街道，探索曾經的宮殿遺跡。埋藏的陷阱、被擄走的同伴，這是一場危機重重尋寶之旅！"
    },
    {
        "date": "20180526",
        "name": "貪婪之城",
        "date_studio": "2018/05/26 Funlock活動創意社",
        "description": "這是一場真實的冒險遊戲，​各位將進入新手村－貪婪之城展開各自的冒險旅程，​多種職業選擇、NPC互動，​個人任務外​​還可自由承接不同任務，​為了伙伴盡可能的解任務賺取報酬吧！"
    },
    {
        "date": "20180812_1",
        "name": "SHINOBI忍",
        "date_studio": "2018/08/12 頂級豬排",
        "description": "【最身歷其境的忍者對決】奉命盜取絕世秘術的夥伴們，必須潛入聖地，和護衛忍者們正面對決！【經典日式場景、忍術武器】枯山水庭園、洞窟神社、密道暗門，想逃出生天先學結印施術！"
    },
    {
        "date": "20180812_2",
        "name": "即刻越獄",
        "date_studio": "2018/08/12 Miss Game",
        "description": "一九二三年，民族自決的思潮，正影響著尚在日本統治下的台灣，你們是與蔣渭水一同進行，「台灣議會設置請願運動」的成員，準備趁日本裕仁皇太子來台巡視時舉旗請願，但日本警察察覺了你們的意圖，因此實施了預防性羈押，將你們關入拘留所，幸好，日本警察中也有支持民族自決理念的人，暗中為你們留下了一些逃出的線索，現在，必須在 20 分鐘內逃出拘留所，才來得及向皇太子請願！"
    },
    {
        "date": "20180813",
        "name": "逃出吸血古堡",
        "date_studio": "2018/08/13 Miss Game",
        "description": "黑暗森林的深處有一座神秘古堡，當地人相傳裡面住著吸人血維生的怪物，沒有人敢靠近，但第一次來到這裡的你們不小心迷路誤闖古堡，被吸血伯爵的手下關進地牢，準備獻給伯爵享用，離天黑只剩下一小段時間了，如果無法在天黑之前逃走，你們就會變成伯爵的晚餐！"
    },
    {
        "date": "20180901",
        "name": "直衝腦門",
        "date_studio": "2018/09/01 4FunBase",
        "description": "2050 年，進入人腦獲取記憶的技術已趨成熟。一次槍戰中，連續殺人犯「約克」中彈即將腦死，警方企圖侵入他的回憶尋找最後一名失蹤者的下落，但一道道的防衛讓警方不得其門而入。身為精英警探的你，是否能把握最後的黃金時刻，突破約克的重重心防，帶回深埋的真相..."
    },
    {
        "date": "20180930",
        "name": "鬼新娘",
        "date_studio": "2018/09/30 笨蛋工作室",
        "description": "在某個不知名的偏遠城鎮，近幾個月來不斷發生一位自殺死亡的女性冤魂帶走年輕男性靈魂的悲慘事件......究竟這個悲劇的始末為何？怎樣才能平息亡魂的怨念？請各位勇敢的驅靈人員前去探索怨靈之地。"
    },
    {
        "date": "20181006",
        "name": "顛倒之室",
        "date_studio": "2018/10/06 笨蛋工作室",
        "description": "相傳二次世界大戰後，廣島市郊有一間戰後仍倖存的詭異房子。這個長年無人居住的小木屋，每年到了 1/4 午夜 00:00 便會傳來微微的音樂聲，且持續一個小時之久，甚至謠傳有人發現房子出現上下顛倒的異象。『顛倒的房子』謎團幾十年來從沒有人解開過，隨著時間的推移，漸漸地成為了都市人們口耳相傳的傳說之謎。 委託人大河： 『幾天前，高齡九十歲的奶奶交給我一把鑰匙，交代我在今天午夜到她廣島的老家來，幫她尋找遺失多年的重要物品，我探聽了一下發現奶奶的老家居然就是廣島都市傳說中的神祕鬼屋，我認為我一個人的力量沒辦法達成目標，希望各位探險隊員能夠協助我解開傳說中的謎團，完成奶奶的心願。』"
    },
    {
        "date": "20181027",
        "name": "醉後任務",
        "date_studio": "2018/10/27 笨蛋工作室",
        "description": "在一個充滿歡笑與希望的城市—巴利市，看似平靜的夜晚卻暗潮洶湧，幾位素昧平生的人陸續造訪 Deja Vu 酒吧，一杯充滿惡意的調酒將每個人的意識抽離......隔天早晨，醒在酒吧樓上的飯店房間裡，周圍是一群生面孔以及一顆即將摧毀小鎮的炸彈，昨晚酒酣耳熱之際，被遺忘的派對時光裡究竟發生了什麼事情？這些人是敵是友？是否能信任？所有人各懷鬼胎，我得一邊回想自己的目的，一邊拯救小鎮倖免於難。"
    },
    {
        "date": "20181122",
        "name": "感染",
        "date_studio": "2018/11/22 Funlock活動創意社",
        "description": "充滿謎團的秘密實驗室。體内不尋常異樣感，到底發生了甚麼事！？​壓抑血液中的病毒千萬要保持理智，找到解藥逃離這裡！"
    },
    {
        "date": "20181124",
        "name": "奪命鎖鏈2",
        "date_studio": "2018/11/24 笨蛋工作室",
        "description": "舉世聞名的慈善企業家比爾丹特 (Bill.Dent) 即將滿 50 大壽， 為了慶祝這一天，丹特宅邸將舉辦一場盛大的生日宴會。 屆時來自全國各地的政商名流將聚集於此， 然而紙醉金迷的背後卻隱藏不為人知的殺機......"
    },
    {
        "date": "20181229",
        "name": "人魚之森",
        "date_studio": "2018/12/29 Enter Space",
        "description": "一片危險的海域上，充滿著暗礁與海草，水手都稱之為「人魚之森」，相傳每年十二月一號，海面上會露出一個岩洞，流傳著諸多關於人魚的傳說故事。赤蠵丸，一艘前往世界各地追尋各式珍奇異寶的探險船，正往人魚之森出發一探究竟。但，一切真的會如此順利嗎？你能順利從這座人魚之森中逃出、帶走傳說中的祕寶嗎？"
    },
    {
        "date": "20190126",
        "name": "奪命記憶",
        "date_studio": "2019/01/26 笨蛋工作室",
        "description": "Deja Vu，似曾相識的感覺，好像曾經發生過，但又好像只是錯覺。但這些似曾相識的既視感真的只是錯覺嗎？還是是被遺忘的過去呢？世界頂級的生技公司 Particle S，其生化部門一夕間消失無蹤，正當外界臆測著各種可能性時，一封神秘的信件邀請你來到這間酒吧，而這封信的寄件人，竟然就是你自己？！被隱藏的真實，等你來挖掘！"
    },
    {
        "date": "20190329",
        "name": "病變",
        "date_studio": "2019/03/29 Funlock活動創意社",
        "description": "昏沈的在病房中醒來，四周充斥莫名的詭異。實驗依舊進行，秘密仍被埋葬，感染正在延續......"
    },
    {
        "date": "20190430",
        "name": "秦關",
        "date_studio": "2019/04/30 覔見實境遊戲​",
        "description": "傳說，得長生者始永得天下！縱然是秦始皇掃蕩六國、一統江山，對於長生不老之術，仍魂牽夢縈。塵封兩千年後的今日，你願意冒險進入秦關探查此千古謎團嗎？"
    },
    {
        "date": "20190511",
        "name": "楓之谷-末日封印",
        "date_studio": "2019/05/11 Miss Game",
        "description": "漫步在西門徒步區，正和好友們討論著要去吃超好吃的雪淇淋，身邊的景物忽然間巨大化......自己也愈變愈小！這裡不是楓之谷世界的西門町嗎？！此時出現了一位自稱赫麗娜的精靈，她說：「數百年前，黑魔法師率領著邪惡軍團支配了整個楓之谷世界。就在陷入絕望之際，名為普利特的英雄，集結了五位英雄與惡勢力展開一場大戰，最終將黑魔法師封印在現在之門中......然而，黑魔法師卻對英雄們下了詛咒，使其長眠並誓言絕對會掙脫封印，並再次肆虐楓之谷世界......百年後的現在，封印之力逐漸減弱，黑魔法師的解放開始倒數，楓之谷再次面臨末日的危機！你們願意帶著封印石進入時間神殿封印黑魔法師嗎？」現在到底是什麼情況？啊啊～不管怎樣，好像也只能先幫忙拯救世界再說了！夥伴們，和我一起衝吧！"
    },
    {
        "date": "20190711",
        "name": "永生劫",
        "date_studio": "2019/07/11 Funlock活動創意社",
        "description": "當今皇上昏庸無能、篤信道術，世間荒淫無道、民不聊生，御醫已煉成長生不老仙丹，五毒教派獻上一石二鳥之計......你必須潛入秘密宅邸，​劫走丹藥，拯救眾生！！"
    },
    {
        "date": "20190826_1",
        "name": "伽斯底里奧內",
        "date_studio": "2019/08/26 LOST迷失密失",
        "description": "乾隆二十三年, 自火燒圓明園悲劇發生以後,十二生肖獸首銅像消失匿跡於世界各地的三坊七巷.你們獲取情報得知生肖銅像的首板仍收藏在銅像設計師伽斯底里奧內家鄉的古堡。通往古堡的大橋將會於 60 分鐘後關掉,你們必需於限時內盜回生肖銅像,否則…….古堡內藏有不少奇珍異寶。除了從銅像著手,你們必需保持冷靜運用其他寶物。切忌一意孤行尋找銅像只會處處碰壁。"
    },
    {
        "date": "20191005_1",
        "name": "瞞天越獄",
        "date_studio": "2019/10/05 Limitless Escape Room 極限密室",
        "description": "潛入北韓找尋軍事機密，不料卻在當地被捕入獄，僅有的線索是當初臥底潛入的夥伴留下的訊息。在失去對外的聯繫下，唯一能依靠的只剩自己和身旁的夥伴，能否在時限內瞞天過海，成功越獄？"
    },
    {
        "date": "20191025_1",
        "name": "遺產",
        "date_studio": "2019/10/25 天橋下工作室",
        "description": "今天6位記憶專家來到此處協助尋回譚老先生的遺產，這次的團隊真的是猛到不行啊！從頭到尾競速狂飆，尋找東西、理解規則、動手解題全部近乎都以無瑕疵的速度刷過去，真是嚇死隨行人了。過程中也不乏些鬧事的搞笑橋段，頗為歡樂，如果各位中間再稍微細心一點點沒做錯，也許就可以刷新最快紀錄了！各位在高速過關之餘，還是不忘了要了解劇情，雖然要兼顧速度並沒有全部的文案都好好看完，但是大致掌握的方向都沒有什麼錯誤，算是很厲害了！對於場景各種象徵意義也有很敏銳的觀察力。實在不敢說各位解得辛苦～但是希望各位不管在劇情還是謎題的體驗上，今天都能夠有段愉快的記憶，感謝各位今天來玩～ ★歪眼睛成就獎：酒壺，當下還看不出來也是情有可原啦～但是下一個成就就說不過去啦～ ★耳包成就獎：人參雞　人參雞？人參雞！？ㄖㄌ？！ㄙㄕ？！害隨行人在後面當場笑出來www ★彩蛋發覺成就獎：果然這種等級的搜索也是馬上就會留意到呢！"
    },
    {
        "date": "20191225",
        "name": "蜀山",
        "date_studio": "2019/12/25 Funlock活動創意社",
        "description": "古時妖魔肆虐為禍蒼生，蜀山宗派集天下異寶鑄神兵以平定亂世， 然而古劍鋒芒過剩，遂毀其晶元並以巨劍陣各別封印。如今災禍再臨，你們即將代表各門派聚集於蜀山禁地，尋回神兵拯救天下！"
    },
    {
        "date": "20200112",
        "name": "我們的秘密",
        "date_studio": "2020/01/12 笨蛋工作室",
        "description": "『這故事好深刻阿，盤旋在心裡散不去』、『角色讓人耳目一新，合理又巧妙的安排！』、『氣氛恰到好處，配些嚇人橋段玩起來超刺激 』。笨蛋工作室回來了，闊別三年我們終於在台北推出了全新的密室逃脫作品。製作「我們的秘密」這款遊戲的過程，我們希望呈現的精神是：用心。從故事起頭，接著鋪陳每一個空間的細節橋段，到最後的裝潢與道具製作，我們希望讓密室逃脫遊戲保有它的每一個優點，好玩、順暢、且耐人尋味。於是「我們的秘密」就這樣誕生了，既驚悚又歡樂、既真實又奇幻、既好玩又沉重。「我們的秘密」不主打浮誇的炫技，而是一個能讓所有玩家都體會到用心且別具風格的優秀主題，我們誠摯的推薦大家來體驗。在遊玩之前你要知道，一群多年交情的死黨，在山上的別墅舉辦生日派對。凌晨，一股不舒服的感覺遍佈全身，睜開眼看到的一切卻讓你無法置信，原本整潔的房間已腐朽崩塌，空氣聞起來讓你寒毛直豎。「到底發生什麼事？大家都沒事吧？」「1..2..3..4.....咦...小青呢？」「小青不見了...她該不會出什麼意外吧...」屋內的景象與氛圍令人作嘔，通往屋外的唯一出口卻被上鎖，看來，只能硬著頭皮往別墅深處探索小青的蹤跡，再找辦法逃到屋外求救，屋子的角落有一張紙條寫著：「我們的秘密」。我們的秘密到底是什麼？"
    },
    {
        "date": "20200115",
        "name": "淡水‧1884",
        "date_studio": "2020/01/15 城市尋寶",
        "description": "◎ 尋寶目標：風水寶盤。一個在淡水生活了八十幾年的獨居老人，離世前將他所有的財產變賣，換成一只清末的古董。他把古董埋在了淡水，把藏寶線索留在遺囑中，說願意把古董送給第一個找到的人。那個古董就是 Ra 指定的物品之一，古董到底埋在哪裡？老人又為什麼要這麼做？一切的謎團等待城寶獵人們來解開。"
    },
    {
        "date": "20200119_1",
        "name": "鄉間小盜",
        "date_studio": "2020/01/19 Funlock活動創意社",
        "description": "矯健的身手，熟捻的技術，盜竊成功後的喜悅讓我沈迷。竊盜組織派下的委託竟是前往這平凡無奇的鄉間小屋，怎麼會有這麼多機關？究竟藏著什麼樣的寶物？​"
    },
    {
        "date": "20200119_2",
        "name": "逃出補習班",
        "date_studio": "2020/01/19 頂級豬排",
        "description": "在以嚴格著稱的ARMED SCHOOL，為快速提升學員的考試能力，提供24小時的自習環境，並於每日早晨6點進行模擬考試，唯有滿分者才能離開。在合理的訓練和不合理的磨練下，期許學員都能成為試試100分的成功者。已經被關在補習班第Ｎ天，日以繼夜日複一日苦讀的學員們，這次，能夠不顧一切地逃出補習班嗎？"
    },
    {
        "date": "20200314",
        "name": "解魅",
        "date_studio": "2020/03/14 FK工作室",
        "description": "25 年前，一場無情的大火，燒毀了一棟屬於曼斯菲爾德家族的華麗莊園。男主人與僕人們皆葬身火窟，但現場卻遍尋不著以才貌雙全聞名的女主人雙胞姊妹。其後，破敗的莊園廢墟怪事連連，有人看見白衣女人的模糊身影，有人聽見男人的悲鳴，更有無數冒險者探訪之後一去不回 ...今天我召集了各位，希望你們能解開籠罩在莊園之下的黑暗謎團！May the god be with you！"
    },
    {
        "date": "20200523_1",
        "name": "入侵者-森林的哀號",
        "date_studio": "2020/05/23 神不在場工作室",
        "description": "經過多年的紛爭，精靈族與人類終於達成和平協議，彼此約定不能互相侵擾，近日卻不斷傳出精靈族入侵人類領土的消息，人類國王擔心事態會越發嚴重，決定派遣一批勇士進入森林調查，但為了防止被精靈族發現，勇士們需偽裝成精靈的模樣，沒想到一進入森林後…眼前的景象卻讓他們震驚不已…"
    },
    {
        "date": "20200523_2",
        "name": "X伯爵的委託II",
        "date_studio": "2020/05/23 神不在場工作室",
        "description": "『快逃吧！不要回頭！自由就在眼前…』，接受伯爵的委託來到古堡的各位，竟然在伯爵房找到兇手犯案的證據!?正要逃離的你們，卻誤觸古堡的保全系統，60分鐘後古堡所有出口都將關閉，你們必須另尋出路，幫助自己逃離古堡。在這過程中，卻意外發現事情另有玄機!?請各位盡可能發掘事情的真相，蒐集更多證據，利用所發現的線索，推斷結論，以利警方逮捕兇手！"
    },
    {
        "date": "20200622",
        "name": "阿瓦隆的背叛者2.0",
        "date_studio": "2020/06/22 4FunBase",
        "description": "聖杯任務失敗後，所幸梅林留下訊息告訴所有騎士們＂聖杯任務失敗早在預料之中，如今只要召喚巨龍才能拯救王國...＂可是能夠召喚巨龍的魔晶全數消失了，加上邪惡勢力的爪牙仍然混在騎士中，伺機蠱動人心....究竟巨龍能否順利現身？還是隱藏的背叛者能以寡敵眾，再次獲勝...一切就看各位的智慧與觀察力了！"
    },
    {
        "date": "20200625_1",
        "name": "羅伯班克",
        "date_studio": "2020/06/25 笨蛋工作室",
        "description": "「羅伯．班克」一個令各家銀行聞風喪膽的名字！沒有人知道他真正的長相，且至今還沒有任何保全系統能夠阻擋他！在重重的疑雲背後，他早已鎖定了下一家銀行準備下手！"
    },
    {
        "date": "20200625_2",
        "name": "馬雅魔方",
        "date_studio": "2020/06/25 笨蛋工作室",
        "description": "馬雅文明早在距今5000年前已存在於地球上，被譽為古代史上最先進和複雜的文明之一，日考古學家前挖掘到一塊散發出強烈能量的神秘方塊，而方塊的光芒指引著我們來到古馬雅..."
    },
    {
        "date": "20200625_3",
        "name": "笨蛋特務",
        "date_studio": "2020/06/25 笨蛋工作室",
        "description": "笨蛋特務的在校生們經過一連串訓練後，驗收成果的時候終於到了！你可以與你的快樂夥伴合作闖關，也可以變成敵人互相傷害！努力通過考驗成為最頂尖的笨蛋特務吧！"
    },
    {
        "date": "20200626_1",
        "name": "秘令1",
        "date_studio": "2020/06/26 哇沙謎創意工作室",
        "description": "江戶時代，接獲秘令的眾忍們，為了達成任務，潛入幕府，通過重重難關，但是任務並非想像中如此單純，究竟夜幕中傳出來的腳步聲，是盟友還是敵人?"
    },
    {
        "date": "20200626_2",
        "name": "秘令2-三劍客的逆襲",
        "date_studio": "2020/06/26 哇沙謎創意工作室",
        "description": "經過多年重重的磨練，終於等到上級傳來的秘令，天野山裡有一座詭譎的般若城，聽說進入此城的人絕無倖免…從上級傳來的消息得知，此城裡面藏有成田將軍多年遺失的秘寶，若能盜取此物必能獲得將軍的重賞，還能成功獲取更高的忍者資格"
    },
    {
        "date": "20200813",
        "name": "怪獸調查局",
        "date_studio": "2020/08/13 Enter Space",
        "description": "一個隱身在三創生活中的神奇次元空間，一場巨大的電子災害危機即將到來，你知道嗎？其實在我們的身邊，潛藏了許多創次元的怪獸！當牠們進入到我們的世界，到底會發生什麼意想不到的事情呢？加入 怪獸調查局，和我們一起找尋真相吧！"
    },
    {
        "date": "20200815_1",
        "name": "獄言",
        "date_studio": "2020/08/15 謎鹿實境遊戲工作室",
        "description": "『來自好友的邀約，昏迷後甦醒，卻發現置身於中國古代監獄，究竟發生了甚麼事？穿越數百年的謎團，你能解開嗎？』"
    },
    {
        "date": "20200815_2",
        "name": "時鐘之國",
        "date_studio": "2020/08/15 頂級豬排",
        "description": "【密室入門推薦、輕鬆成團】40分鐘遊戲時間，2~4人即可成團，親民票價，最適合想要嘗試看看的你~【精緻場景、經典機關】蒸氣龐克風格特色場景、全自動機關設計、聲光效果十足。"
    },
    {
        "date": "20200815_3",
        "name": "鬼靈精怪店",
        "date_studio": "2020/08/15 頂級豬排",
        "description": "死神見習生的年度結算迫在眉睫，平時不努力的小小鬼差們臨時抱鬼腳，想找到傳說中的鬼靈精怪店。店內商品包羅萬象，只要能找到門路肯定有救。鬼界中的小小奇幻生物會幫你一把嗎？"
    },
    {
        "date": "20200828",
        "name": "奪寶令",
        "date_studio": "2020/08/28 4FunBase",
        "description": "深藏在天才博士 Xavier 宅邸的超級能量石 Aroti 引發了各界的覬覦與爭奪，但博士設下的層層機關和陷阱卻讓所有潛入盜寶者全軍覆沒。特務總部收到了兩份委託書皆要求不惜任何代價奪得能量石。所以你們將兵分兩路分頭前進，也藉此顯示誰才是菁英中的菁英！當然，獲勝的報酬會是很豐厚的！"
    },
    {
        "date": "20201017",
        "name": "冥婚",
        "date_studio": "2020/10/17 頭癮創意遊戲",
        "description": "那天，你突然回想 1987 年的夏天，當時窮困潦倒的你，在路邊撿了一個紅包，發現當中有著幾百元之外，還有著一小撮頭髮…一向鐵齒的你把紅包丟進了路邊的垃圾桶，卻做了一場怪夢後，紅包竟然又出現在房間的床頭！之後你的生活開始出現種種不順，打算去宮廟問問關於這個紅包的事情。只見師父眉頭一皺，讓你擔憂事情並不單純…經過指點之後，遵照著指示，來到彰化縣的一戶民宅門口，在這看似無奇的大門之後，到底藏著什麼沒有被揭發的故事呢？"
    },
    {
        "date": "20201024",
        "name": "尖山陶寶",
        "date_studio": "2020/10/24 城市尋寶",
        "description": "◎ 尋寶目標：不知名的陶藝品。一名享譽國際的陶藝大師，他的作品櫃裡擺滿許多得了國際獎項的陶藝品，但在最高處卻有一個空位，據說是為了他的第一個作品而留的。陶師總是叨念著的心願就是要把他的第一個作品找回來，但卻一直不見他有實際動作，他的學生曾問他為什麼不去找，陶師只搖頭說時機還沒到。那個陶藝品就是 Ra 指定的物品之一，到底作品藏在哪裡？為什麼陶師想找又不去找回來？一切的謎團等著城寶獵人們來解開..."
    },
    {
        "date": "20201219",
        "name": "稻荷之歌",
        "date_studio": "2020/12/19 Funlock活動創意社",
        "description": "相傳狐狸娶親時，會選在太陽雨的日子。牠們會排成長長一列，手上提著燈籠，從遠方看來就像鬼火一樣...誤闖狐狸娶親的隊伍，絕對不要發出聲音。若被祂們發現，將回不去原本的世界⋯"
    },
    {
        "date": "20210101_1",
        "name": "第九夜",
        "date_studio": "2021/01/01 格林跳工作室",
        "description": "一封署名第九夜的信函，指引偵探來到一幢無人老屋，屋內陣陣聲響藏著什麼秘密？偵探們，只剩有限的時間能完成探案..."
    },
    {
        "date": "20210101_2",
        "name": "攝影屍",
        "date_studio": "2021/01/01 笨蛋工作室",
        "description": "「連續模特兒血案」短短一個月內，四名知名模特兒被殘忍殺害，死者皆遭到長時間痛苦的凌虐後才斷氣，警方深入調查，發現多年前四名死者曾參加過一個共同的攝影計畫，而當年主持此計畫的攝影師卻早已銷聲匿跡，攝影棚也停業多年。當年光鮮亮麗的攝影棚內藏著的秘密，要付出多少代價挖掘呢？"
    },
    {
        "date": "20210101_3",
        "name": "前哨戰",
        "date_studio": "2021/01/01 格林跳工作室",
        "description": "武力戰尚未爆發，情報戰卻早已開打，越快破譯敵國軍備情報的一方，越能在大戰中取得勝利，祖國的未來寄託在這場前哨戰中，此時突然出現的秘密組織，又會對戰局帶來什麼影響..."
    },
    {
        "date": "20210102",
        "name": "腥院",
        "date_studio": "2021/01/02 濤濤來工作室",
        "description": "以恐怖靈異現象聞名的廢棄醫院佇立眼前，傳聞中...進去的人不是都失蹤了，就是在被尋獲後神經錯亂發瘋了...現在，各位就站在這間醫院前，猶豫著是否要進去...."
    },
    {
        "date": "20210116_1",
        "name": "北城清涼記",
        "date_studio": "2021/01/16 城市尋寶",
        "description": "◎ 尋寶目標：臺灣民主國總統印，臺灣民主國留下的文物屈指可數，其中最讓人夢寐以求的國寶--『臺灣民主國總統印』，一直無人知道下落......直到最近。臺北舊城不久前出土了一具骸骨，骸骨懷中抱著一綑棉布，上面竟記載了臺灣民主國總統印的下落！經分析骸骨與棉布皆已逾百年之久，因此可信度極高！而總統印，也是 Ra 指定的物品之一。你能找回國寶嗎？那副骸骨跟棉布又是怎麼回事？一切的謎團等待城寶獵人們來解開。"
    },
    {
        "date": "20210116_2",
        "name": "刑務所脫出",
        "date_studio": "2021/01/16 脫離現實xQhat帽子烤工廠",
        "description": "網走監獄，它不只代表堅不可破的牢籠，同時也代表酷寒和死亡…在這充滿傳奇故事的極寒牢籠裡，你能夠從一道道受刑人留下的痛苦刨削痕跡中，跟上脫獄魔白鳥由榮的腳步，逃離這世界的盡頭嗎？！"
    },
    {
        "date": "20210122",
        "name": "流亡黯道",
        "date_studio": "2021/01/22 Miss GAME",
        "description": "傳說 300 年前，永恆帝國首席奇術師馬拉凱發明將古靈寶石植入人體、賦予使用者各種強大能力的方法。而寶石皇后則是他的最高傑作。 根據記載，寶石皇后身上有一顆永生之石，賦予她不朽的能力。但在一場異變之後，永恆帝國就此覆滅，帝國所在的瓦爾克拉斯大陸成為鬼島，被作為犯人的流放地， 同時再也沒人看過寶石皇后...... 神秘的奇術師派蒂相信永生之石仍然存在，她提出了條件， 只要流亡者能夠進入日耀神殿的遺跡，帶回永生之石，她就幫助流亡者逃離鬼島......"
    },
    {
        "date": "20210123",
        "name": "噬夢",
        "date_studio": "2021/01/23 Funlock活動創意社",
        "description": "傳說中夜魔會吞噬美夢，讓人們沉睡不醒，如今你已經陷入惡夢的輪迴，不理解黑暗的人才會害怕夜晚，面對恐懼才能打破迴圈，沉浸夢中的你能否逃離？"
    },
    {
        "date": "20210201_1",
        "name": "迴異路 重置",
        "date_studio": "2021/02/01 玩笑實驗室",
        "description": "「憶空門關閉，記憶連結中斷。」博士使用最新儀器『憶空門』進入記憶探索，卻因無法在時間內回來而昏迷。博士出發前留下字條「如果我沒回來，表示實驗失敗，別來救我，可能很危險。」儘管如此，研究人員仍前往調查，卻也發現博士不為人知的秘密…"
    },
    {
        "date": "20210201_2",
        "name": "拉麵の奧義",
        "date_studio": "2021/02/01 脫離現實xQhat帽子烤工廠",
        "description": "從安利美特盜走最強拉麵奧義的神秘人，三天前被目擊到進入白色大樓後就此不見蹤影，根據IGO國際美食機構的推測，奧義應該被藏在了這棟白色大樓中的某一處，行こう！！徵召全台美食獵人集合組隊，幫助安利美特找回被盜走的奧義捲軸！"
    },
    {
        "date": "20210209",
        "name": "鄉間小盜",
        "date_studio": "2021/02/09 Funlock活動創意社",
        "description": "矯健的身手，熟捻的技術，盜竊成功後的喜悅讓我沈迷。竊盜組織派下的委託竟是前往這平凡無奇的鄉間小屋，怎麼會有這麼多機關？究竟藏著什麼樣的寶物？"
    },
    {
        "date": "20210401",
        "name": "獨眼傑克",
        "date_studio": "2021/04/01 邏思起子工作室",
        "description": "18 世紀，海上歷史寫下新頁，許多傳奇隨之而生，「獨眼傑克」就是那其中之一。他是荷蘭東印度公司最大的敵人！然而，一次行動失敗，他被荷蘭東印度公司俘虜成為奴隸，從未放棄逃生的他賭上一切，留下了一封瓶中信……。這次，我們將化身熱血海盜，依循傑克留下的線索，劫取東印度公司的商船，搶奪所有財寶！"
    },
    {
        "date": "20210428",
        "name": "迷霧島",
        "date_studio": "2021/04/28 邏思起子工作室",
        "description": "你曾聽過蓋亞能源嗎？傳說它被藏於迷霧島，並由三個古老文明守護，只有登入迷霧島，走進遺跡，完成儀式才能喚醒蓋亞能源，各位探險家！運用你們的智慧與勇氣完成遺跡的挑戰！祝各位好運～"
    },
    {
        "date": "20210612",
        "name": "初來炸到",
        "date_studio": "2021/06/12 居加事務所",
        "description": "大樓炸彈即將引爆，限時70分鐘，你們能完美解除，救出所有人嗎！？"
    },
    {
        "date": "20211009_1",
        "name": "這個Case有點Big",
        "date_studio": "2021/10/09 LoGin",
        "description": "『一場發生在行李箱中的奇幻冒險，世界上怎麼會有那麼大的行李箱啊？再不逃出去，就要被永遠困在這裡了！』LoGin偵探社最近收到了一封奇怪的委託信，一位著急的媽媽聲稱她失蹤的10歲兒子被邪惡的科學家綁架了。(這年代還有邪惡的科學家嗎…)但當偵探社聯繫她時，卻又堅決否認寄出過這封信，這個案子也就不了了之…但這位媽媽突然又聯繫了偵探社表示她已潛入科學家的研究所，希望我們能派出偵探協助她，但一時之間實在抽不出人手…你看起來挺聰明的，能幫個忙嗎？嗯！那就麻煩你啦！(๑•̀ㅂ•́)و✧"
    },
    {
        "date": "20211009_2",
        "name": "等一個人・盜墓",
        "date_studio": "2021/10/09 LoGin",
        "description": "西域沙漠中突然出現了一座神秘的古墓，陵墓的主人正是消失已久的樓蘭女王，政府派出一支考古隊前往調查，但他們卻離奇的失去了聯繫，於是政府秘密派遣盜墓賊再次前往。究竟，會在裡面發現什麼……？"
    },
    {
        "date": "20211023_1",
        "name": "翻箱盜櫃：上鎖的靈感",
        "date_studio": "2021/10/23 Enter space",
        "description": "「偷」一定是幹壞事？身為時空竊賊的各位，總是在不計報酬的情況下，穿梭時空改變過去與未來，以成就一件件外人看來似乎微不足道的小事。這次，你們將受到一名狂熱粉絲的請託，將青年漫畫家劉孝威的著名漫畫《項羽之血》的結局偷竊到手，但事情真的有如此順利嗎?"
    },
    {
        "date": "20211023_2",
        "name": "那未了的話",
        "date_studio": "2021/10/23 Enter space",
        "description": "六年感情戛然而止，是誰都無法招架這種悲傷吧...那封他生前寄來的信封裡，沒寫著幾個字，只有前往某個儲藏室的指引...看著曾經崩潰的小屏，現在依然如此虛弱。那些被遺留的，未了的話，就讓我們去尋找吧..."
    },
    {
        "date": "20211224",
        "name": "竹本家",
        "date_studio": "2021/12/24 笨蛋工作室",
        "description": "故事發生在一個開業三十年的老店『竹本家手作茶』，因為第一代陳添福老闆的堅持，最好的食材搭配充滿溫情的經營模式，讓竹本家成為全國饕客爭相拜訪的手搖名店。但好景不常，在陳添福過世後由第二代三兄弟接手，不僅竹本家的生意每況愈下，更傳出食安問題。許多受害者揚言提告並要求賠償，而今日的代班店員也意外捲入駭人的突發事件！身為店員的各位有辦法度過這個危機嗎？"
    },
    {
        "date": "20211231_1",
        "name": "重返地平線",
        "date_studio": "2021/12/31 玩有引力工作室",
        "description": "在未來，第三次世界大戰後，由人類開發出的具備情感與自我意識的人工智能機器人，取得了勝利並掌控了自由與權力，人類在這些終極機器面前， 毫無抵抗之力，人口銳減了八成…剩餘的部分人們依舊懷著希望與機器人不懈奮鬥、抗爭，這些人被視為危險犯罪者，如被抓住將送往離地球4.2光年的Z3行星-凱勒斯太空站執行冷凍冬眠懲罰。在那裡，據說人們於冷凍睡眠時，都會做同一夢，一個回到地球的美夢…而這次，10年才有一次的解凍自由時間，輪到了F區的各位…"
    },
    {
        "date": "20211231_2",
        "name": "地心任務",
        "date_studio": "2021/12/31 玩有引力工作室",
        "description": "一場突如其來的全球性危機，各式各樣的異常災害不斷發生，面對此次危機，目前唯一可行的方法竟藏於地球上最神秘的大陸-南極洲，你將在冰天雪地的嚴寒中尋找答案，並深入未知的地心執行這件看似不可能的任務…"
    },
    {
        "date": "20211231_3",
        "name": "冒險王",
        "date_studio": "2021/12/31 哇沙謎創意工作室",
        "description": "傳說在百慕達三角洲一帶有一座神秘的島嶼，歷史至今為了前往島嶼的海盜、冒險家皆無一倖免，因此有著死亡島之稱。據說這個死亡島藏有許多珍貴的寶藏，還蘊含著不可思議的力量，唯有成功奪取寶藏並活著回來才能成為冒險王！"
    },
    {
        "date": "20220101_1",
        "name": "串城流浪記",
        "date_studio": "2022/01/01 城市尋寶",
        "description": "台中舊車站上的老時鐘，在數十年前被拆下換成了台鐵標誌，原來的老時鐘不知去向，卻在最近傳出消息–『老時鐘被藏在台中舊城區最熱鬧的地方』。這個見證舊城最輝煌時光的老時鐘，同時也是 Ra 指定的物品，立刻引起收藏家們熱烈的討論，但大部份的人認為–『舊城區早已沒落，找不到熱鬧的地方了』，所以這個消息就被當成玩笑，很快的又失去了關注…但凡事總有例外，還是有人執著地前往尋寶了。他在尋寶途中，遇見了一名奇怪的流浪漢，他最後是否能找回老時鐘？流浪漢又真的只是名流浪漢嗎？一切的謎團等待城寶獵人們來解開。"
    },
    {
        "date": "20220101_2",
        "name": "壹零玖伍：禁錮之宅",
        "date_studio": "2022/01/01 BGLOCK推理解謎館",
        "description": "你們在劉家村清貧的生活著，一日耳聞後山藏有密寶，為求富貴 相約上山尋寶，卻遭逢惡劣氣候，不慎跌落山崖，醒來後只見眼前聳立一座與世隔絕的奇特大宅…"
    },
    {
        "date": "20220101_3",
        "name": "1407 巴爾飯店",
        "date_studio": "2022/01/01 BGLOCK推理解謎館",
        "description": "十九世紀中期，一位窮困潦倒的女畫家瓊安娜，來到了巴爾飯店入住1407房。從這天起，瓊安娜的畫作產生了驚人蛻變與進步，為避免靈感消失，她選擇長住在此，不久後，她成了法國最有人氣、最讓人期待的畫家。飯店也因此間接受到大家注意，生意扶搖直上。直至某日，飯店14樓開始發生詭異的超自然事件，不堪其擾的飯店只能委託當地神父進行調查，但沒想到這卻是一連串不幸事件的開端…"
    },
    {
        "date": "20220102_1",
        "name": "生日大餐",
        "date_studio": "2022/01/02 黑盒子工作室",
        "description": "那一天，是我的生日……我想知道，在那個令人難忘的日子，到底發生了什麼事？是否曾在夜深人靜時，窩在沙發看著恐怖片，享受著那打從心底顫出來的寒意？這個故事，適合喜歡驚悚電影的你。"
    },
    {
        "date": "20220102_2",
        "name": "惠貞女子高校",
        "date_studio": "2022/01/02 Loop迴圈工作室",
        "description": "「請救救我的…學校…」「千萬不可不信邪…」『 快逃！！！ 』陌生而嘈雜的聲音，縈繞在出發前一晚，斷斷續續的夢中…明天，真的還要去那所廢棄學校探險嗎…？"
    },
    {
        "date": "20220102_3",
        "name": "布蘭古堡Ｉ。疑雲 與 布蘭古堡ＩＩ。鬼影",
        "date_studio": "2022/01/02 說故事工作室",
        "description": "千年古堡，在歷史的洪流中，靜靜的聳立著，暗藏的故事，無人知曉－－"
    },
    {
        "date": "20220116",
        "name": "奉獻",
        "date_studio": "2022/01/16 克蘇魯工作室",
        "description": "你們各位接到了委託，來到了一處於地下室開辦的個人畫展，透過報紙得知那位名偵探-威波巴恩斯似乎在最近突然消聲匿跡了。而他被目擊到的最後身影，也是在某個地下室的個人畫展中，難道這僅僅只是巧合嗎？究竟名偵探的消失與這次的委託有什麼樣關係呢？本次的委託你們又能否順利解決呢？"
    },
    {
        "date": "20220205",
        "name": "辛亥隧道",
        "date_studio": "2022/02/05 邏思起子工作室",
        "description": "握上方向盤，踩下油門，六人座的廂型車駛入辛亥隧道，為的是辛亥隧道內的靈異傳聞，但當你們開入隧道後才發現，等著你們的並非乏善可陳的靈異故事，歡迎光臨格下開運租車行，接下來，歡迎親自上車體驗"
    },
    {
        "date": "20220219_1",
        "name": "奇術師",
        "date_studio": "2022/02/19 Miss Game",
        "description": "漂流到鬼島的流亡者們，在逃離鬼島的過程中誤踩傳送陣，被傳送到鬼島上的神殿遺跡內，在此遇到奇術師派蒂。派蒂說這座神殿被施展了時空凍結的奇術；如果繼續待在神殿內，將會成為這靜止時空的一部份，永遠被困住，再也無法離開！但不慎觸發的古代封印，讓整座神殿的結構完全改變，逃出的路已消失無蹤⋯⋯流亡者們能在時間內找到另一條生路，逃出神殿嗎？"
    },
    {
        "date": "20220219_2",
        "name": "深處",
        "date_studio": "2022/02/19 笨蛋工作室",
        "description": "我們是一群孤兒，完全不記得自己親生父母的樣子，或許我們就是沒人要的孩子吧，好險有「新家」接納了我們，孤單的孩子們在這裡得以溫飽，一起玩樂一起長大，這裡，有我們的「爸爸媽媽」。每隔一段時間，特別懂事的哥哥姊姊們會被選去「樂園」領取獎勵，聽說，那裡有玩不完的遊戲、吃不完的點心，真是羨慕他們！今天不應該是樂園開放的日子，但在深夜「媽媽」點亮了樂園的七彩燈光，好開心啊！樂園的深處到底有什麼在等我們呢！"
    },
    {
        "date": "20220228",
        "name": "微笑謎藏",
        "date_studio": "2022/02/28 智慧獵人",
        "description": "西元 2006 年，東歐地區發生了一連串的孩童誘拐案件，隨著新聞的渲染，媒體將兇手冠上一個詭異的稱號 -「微笑天使」多項傳聞指出，「微笑天使」很有可能與斯邁爾孤兒院的院長有關...案件最終以院長的自殺作結，孤兒院也成為廢墟。然而在幾年後的今天，一群懷著不同目的的人，來到廢棄已久的孤兒院。不該有人的庭院深處，竟傳來呼救的聲音？！當微笑的殺意接近，只有互相合作才能逃出「噓！祂出現了！… 」「趁祂進入祈禱室，1、2、3 跑！」"
    },
    {
        "date": "20221008_1",
        "name": "迷豆",
        "date_studio": "2022/10/08 謎書狗工作室",
        "description": "每個夜晚長輩都會對孩子們說童話故事，但是《杰克與魔豆》的杰克失蹤了，這本故事書將無法繼續下去而面臨崩壞，就在這時收到一個神祕包裹，裡面夾放著一封信…『偉大的修書人，拜託快來幫幫我！』 BY 杰克 看來發生很嚴重的事情了…"
    },
    {
        "date": "20221008_2",
        "name": "龍劫",
        "date_studio": "2022/10/08 謎書狗工作室",
        "description": "定海神針在某夜忽然斷裂失去了重要支撐，大海開始動盪不安，在過不久，齊天大聖就要來到東海龍宮，少了重要的法器海底世界將面臨毀滅，而《西遊記》也不復存在，統治深海的龍王-敖廣好像發生了什麼事…『修書人們阿，你們是我唯一的希望… by敖廣』"
    },
    {
        "date": "20221022",
        "name": "鱗屋之中·惡夢版",
        "date_studio": "2022/10/22 頂級豬排",
        "description": "崖邊那棟樓房，磚瓦整齊鱗列，偶爾閃耀波光水紋，當地人稱這奇異樓房為──鱗屋。朝鱗屋望去，似乎有種黑影散發出嘲弄訪客的惡意，深入探索，能否在惡夢詛咒中抽絲剝繭找到希望呢?"
    },
    {
        "date": "20221105",
        "name": "月夜獨嚎",
        "date_studio": "2022/11/05 頂級豬排",
        "description": "寧靜僻世的犬神村究每逢月圓之夜，便會遭到不明異獸襲擊。村民高額懸賞獵人，希望能永除後患。言談中你總覺得委託著神祕並語帶保留，似乎還有其他秘密。每逢月圓便出現的巨獸，欲言又止的村民，遍布四周的鋸齒葉植物月光下散發惡意…"
    },
    {
    	"date": "20221119_1",
    	"name": "櫻花暖居",
        "date_studio": "2022/11/19 穿越者",
        "description": "在日本新宿郊區有一間廢棄房屋，相傳深夜如果靠近會聽到室內傳出女人的哭聲，路過的人被迷惑進入後失踪...這所昭和25年間流傳下來的古屋常年貼著封條，宿內陰冷無光。這晚醉酒的幾人路過...笑聲木屐聲迴盪在空巷中。"
    },
    {
    	"date": "20221119_2",
    	"name": "醉後一杯",
        "date_studio": "2022/11/19 穿越者",
        "description": "Throughe Bar 是每一個愛酒者的天堂，Eason就是其中之一，Eason經常出入酒吧，每晚都喝得酩酊大醉。Eason每次都是被朋友送回家，像往常一樣，宿醉的你，準備起床再去酒吧繼續喝，可你發現自己已經身處一個暗巷內，面前是自己常去的Throughe Bar，你只好走進去了...。為什麼不記得自己怎麼來Throughe Bar的？是什麼原因讓Eason每天買醉呢？今天又會像往常一樣喝醉了再回家嗎？"
    },
    {
    	"date": "20230101_1",
    	"name": "泰洛爾號",
        "date_studio": "2023/01/01 玩出計畫",
        "description": "傳聞在生與死的交界，藏匿著能實現所有心願的水晶，凡事皆有可能，取決於你是否相信傳說，如果願望可以實現，你會如何選擇？"
    },
    {
    	"date": "20230101_2",
    	"name": "靈居",
        "date_studio": "2023/01/01 玩出計畫",
        "description": "根據鄰居的口供，濃濃的瓦斯味，隱約的哭泣聲，不尋常的歌聲，打破了單親家庭的平凡生活，看似簡單的命案，卻隱約散發出駭人的氣息，我必須破案…"
    },
    {
    	"date": "20230101_3",
    	"name": "歿世淨土",
        "date_studio": "2023/01/01 玩出計畫",
        "description": "不久的將來，因人類對地球的糟蹋，導致海平面急遽上升，地表不到幾周就被大量海水淹沒，全球僅剩一座島嶼可供人類苟延殘喘。但好鬥的人類沒有就此罷休，他們群雄割據，將島嶼瓜分為六大國，乍看表面和樂融融，私底下卻不斷地明爭暗鬥。但據謠傳，近期有新的革命組織興起，打著團結的名號想終結六國的統治，於是六國首相決定團結起來，合資成立了「國安情報局」來打擊共同的敵人。"
    },
    {
    	"date": "20230103",
    	"name": "穹頂計畫",
        "date_studio": "2023/01/03 聚樂邦",
        "description": "「這一次，讓我們幹一票大的。」古老的書信、充滿符號的術語、看不懂的筆記⋯⋯這是鑑定師金妮寄給你們——寶藏獵人團「六奇士」的包裹。「如果要解開其中的秘密，我們得去奇美博物館一趟。」金妮留下這句話，到了約定的時間卻不見蹤影。你們手上的包裹是否能找回她的下落？或是會發現更驚人的秘密？而那一路上窺伺著你們的人影，又是誰……？！屬於你和夥伴的寶藏／真相追索之旅，就此展開！"
    },
    {
    	"date": "20230114_1",
    	"name": "洛克飯店：殺手困境",
        "date_studio": "2023/01/14 智慧獵人",
        "description": "受邀到洛克鎮參加音樂嘉年華的你們，因為飯店的烏龍事件，被帶到一位殺手的房間，而殺手，就在門外！飯店手機裡，一通來自未來的電話，『你們將在60分鐘後遭到門外殺手的攻擊並喪命，幸運的是，因為不明原因的時空混亂，你們將有機會改變自己的未來』眼看時間一分一秒過去，你們的生命維繫在一個名叫Tony的小男孩身上？"
    },
    {
    	"date": "20230114_2",
    	"name": "洛克飯店：維多莉亞的祕密",
        "date_studio": "2023/01/14 智慧獵人",
        "description": "紅極一時的女星-維多莉亞，在演藝事業高峰期，閃電息影並嫁給鬼才導演-李島衍。原本令人稱羨的影壇佳偶，卻在婚後變了調….「2/15中午，我會臨時約她在洛克飯店的餐廳吃飯，請你們趁這段時間，去調查我老婆入住的房間，看看她是不是真的背叛了我。」"
    },
    {
    	"date": "20230403",
    	"name": "利維德酒吧",
        "date_studio": "2023/04/03 LoGin",
        "description": "傳說有一間酒吧，喝了這裡的酒，便能獲得一段意想不到的愛情，它沒有固定地址、沒有營業時間、連酒……也沒有價格，只需用你一個最難忘的故事，就能換一杯「L’amour」……－LoGin偵探社再次接到了一件奇特的委託，被診斷出失憶症、離不開醫院的委託人希望我們能替她奪回她的記憶。今日，身為偵探社菜鳥的你們來到了與前輩約定的地點，只見一家古老的酒吧。難不成，委託人的「故事」就在這家酒吧裡……？"
    },
];


function init() {
	var card_columns_div = document.getElementById("cardColumnsDiv");
	var escape_section = document.getElementById("escape");

	for (var i = 0; i < escape_datas.length; i++) {
		card_columns_div.innerHTML += '<div><img class="card-img" src="images/escape/' + escape_datas[i]['date'] + '.jpg" alt="Card image" data-toggle="modal" data-target="#modal' + escape_datas[i]['date'] + '"></div>';
	}
	for (var i = 0; i < escape_datas.length; i++) {
		escape_section.innerHTML += '<!-- Detail modal ' + escape_datas[i]['date'] + '--> \
										<div class="modal fade" id="modal' + escape_datas[i]['date'] + '" tabindex="-1" role="dialog" aria-labelledby="modal' + escape_datas[i]['date'] + 'Label" aria-hidden="true"> \
											<div class="modal-dialog modal-lg modal-dialog-centered" role="document"> \
												<div class="modal-content p-2"> \
													<div class="modal-header"> \
														<h5 class="modal-title" id="modal' + escape_datas[i]['date'] + 'Label">' + escape_datas[i]['name'] + '</h5> \
														<button type="button" class="close" data-dismiss="modal" aria-label="Close"> \
															<span aria-hidden="true">&times;</span> \
														</button> \
													</div> \
													<div class="modal-body"> \
														<div><a>' + escape_datas[i]['date_studio'] + '</a></div> \
														<div class="p-2"><img src="images/escape_origin/' + escape_datas[i]['date'] + '.jpg" class="img-thumbnail"/></div> \
														<div>' + escape_datas[i]['description'] + '</div> \
													</div> \
												</div> \
											</div> \
										</div>';
	}

	var count = escape_datas.length;
	document.getElementById("pageTitle").innerHTML = "Escape Room (" + count + ")";
}